airpollu/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            fixedValue;
        value           uniform 0.5;
    }

    outlet
    {
        type            zeroGradient;

    }

    bulid
    {
        type            zeroGradient;
    }
    source
    {
    	type            zeroGradient;
    	//value           uniform 0;
    	
    }

    
}

// ************************************************************************* //

