airpollu/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    bulid
    {
        type            zeroGradient;
    }
    source
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
/*floor
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
        value           uniform 0.5;
    }

    outlet
    {
        type            zeroGradient;

    }

    bulid
    {
        type            zeroGradient;
    }
    source
    {
    	type            fixedValue;
    	value           uniform 0.5;
    	
    }
*/
