airpollu/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bulid
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
    source
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
/*boundaryField
{
    "(inlet|outlet)"
    {
        type            calculated;
        value           uniform 0;
    }

    topAndBottom
    {
        type            zeroGradient;
    }

    wall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
*/
